import React, { Component } from 'react'
import { Helmet } from 'react-helmet';
import NavM from "../homepage/js/nav";
import $ from "jquery"
import "./FriendLink.css"
export default class FriendLink extends Component {
    state = {
        near: [],
        far: [],
        big: [],
        mine: []
    }
    componentWillMount() {
        $.ajax({
            url: "https://www.modestfun.com:8080/getFriend"
        }).then(res => {
            var near = []
            var far = []
            var big = []
            var mine = []
            res.forEach(item => {
                if (item.friendType == '身边的朋友') {
                    near.push(item)
                } else if (item.friendType == '远方的伙伴') {
                    far.push(item)
                } else if (item.friendType == '私人项目') {
                    mine.push(item)
                } else if (item.friendType == '大佬的博客') {
                    big.push(item)
                }
            })
            this.setState({
                near: near,
                far: far,
                big: big,
                mine: mine
            })
        })
    }
    render() {
        const { near, far, mine, big } = this.state
        console.log(this.state)
        return (
            <div style={{ overflow: "hidden" }}>
                <Helmet>
                    <meta charSet="utf-8" />
                    <title>友链 | Modest的个人博客</title>
                    <link rel="icon" href="https://modestfun.com:8080/img/?name=logo" />
                </Helmet>
                <NavM></NavM>
                <div className="fixcontainer"></div>
                <div className="container">
                    <div className="ruleCard">
                        <h3 className="ruleTitle">链接申请说明</h3>
                        <h4 className="ruleIntro">
                            <span style={{ color: "red" }}><svg t="1586595445601" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1874" width="16" height="16"><path d="M514.5 989.6c-64.5 0-127.1-12.6-186.1-37.6-56.9-24.1-108-58.5-151.9-102.4-43.9-43.9-78.3-95-102.4-151.9-24.9-58.9-37.6-121.5-37.6-186.1s12.6-127.1 37.6-186.1c24.1-56.9 58.5-108 102.4-151.9s95-78.3 151.9-102.4c59-24.9 121.6-37.6 186.1-37.6s127.1 12.6 186.1 37.6c56.9 24.1 108 58.5 151.9 102.4 43.9 43.9 78.3 95 102.4 151.9 24.9 58.9 37.6 121.5 37.6 186.1s-12.6 127.1-37.6 186.1c-24.1 56.9-58.5 108-102.4 151.9-43.9 43.9-95 78.3-151.9 102.4-59 24.9-121.6 37.6-186.1 37.6z m0-896c-230.5 0-418 187.5-418 418s187.5 418 418 418 418-187.5 418-418c-0.1-230.5-187.6-418-418-418z" fill="#d81e06" p-id="1875"></path><path d="M329.7 726.1c-7.7 0-15.4-2.9-21.3-8.8-11.7-11.7-11.6-30.7 0.1-42.4L659 326.2c11.7-11.7 30.7-11.6 42.4 0.1s11.6 30.7-0.1 42.4L350.9 717.3c-5.9 5.9-13.5 8.8-21.2 8.8z" fill="#d81e06" p-id="1876"></path><path d="M688.3 725.4c-7.7 0-15.4-2.9-21.3-8.8L318.3 366c-11.7-11.7-11.6-30.7 0.1-42.4s30.7-11.6 42.4 0.1l348.7 350.5c11.7 11.7 11.6 30.7-0.1 42.4-5.8 5.9-13.4 8.8-21.1 8.8z" fill="#d81e06" p-id="1877"></path></svg>经常宕机</span>
                            <span style={{ color: "red", marginLeft: "15px" }}><svg t="1586595445601" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1874" width="16" height="16"><path d="M514.5 989.6c-64.5 0-127.1-12.6-186.1-37.6-56.9-24.1-108-58.5-151.9-102.4-43.9-43.9-78.3-95-102.4-151.9-24.9-58.9-37.6-121.5-37.6-186.1s12.6-127.1 37.6-186.1c24.1-56.9 58.5-108 102.4-151.9s95-78.3 151.9-102.4c59-24.9 121.6-37.6 186.1-37.6s127.1 12.6 186.1 37.6c56.9 24.1 108 58.5 151.9 102.4 43.9 43.9 78.3 95 102.4 151.9 24.9 58.9 37.6 121.5 37.6 186.1s-12.6 127.1-37.6 186.1c-24.1 56.9-58.5 108-102.4 151.9-43.9 43.9-95 78.3-151.9 102.4-59 24.9-121.6 37.6-186.1 37.6z m0-896c-230.5 0-418 187.5-418 418s187.5 418 418 418 418-187.5 418-418c-0.1-230.5-187.6-418-418-418z" fill="#d81e06" p-id="1875"></path><path d="M329.7 726.1c-7.7 0-15.4-2.9-21.3-8.8-11.7-11.7-11.6-30.7 0.1-42.4L659 326.2c11.7-11.7 30.7-11.6 42.4 0.1s11.6 30.7-0.1 42.4L350.9 717.3c-5.9 5.9-13.5 8.8-21.2 8.8z" fill="#d81e06" p-id="1876"></path><path d="M688.3 725.4c-7.7 0-15.4-2.9-21.3-8.8L318.3 366c-11.7-11.7-11.6-30.7 0.1-42.4s30.7-11.6 42.4 0.1l348.7 350.5c11.7 11.7 11.6 30.7-0.1 42.4-5.8 5.9-13.4 8.8-21.1 8.8z" fill="#d81e06" p-id="1877"></path></svg>不合法规</span>
                            <span style={{ color: "red", marginLeft: "15px" }}><svg t="1586595445601" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1874" width="16" height="16"><path d="M514.5 989.6c-64.5 0-127.1-12.6-186.1-37.6-56.9-24.1-108-58.5-151.9-102.4-43.9-43.9-78.3-95-102.4-151.9-24.9-58.9-37.6-121.5-37.6-186.1s12.6-127.1 37.6-186.1c24.1-56.9 58.5-108 102.4-151.9s95-78.3 151.9-102.4c59-24.9 121.6-37.6 186.1-37.6s127.1 12.6 186.1 37.6c56.9 24.1 108 58.5 151.9 102.4 43.9 43.9 78.3 95 102.4 151.9 24.9 58.9 37.6 121.5 37.6 186.1s-12.6 127.1-37.6 186.1c-24.1 56.9-58.5 108-102.4 151.9-43.9 43.9-95 78.3-151.9 102.4-59 24.9-121.6 37.6-186.1 37.6z m0-896c-230.5 0-418 187.5-418 418s187.5 418 418 418 418-187.5 418-418c-0.1-230.5-187.6-418-418-418z" fill="#d81e06" p-id="1875"></path><path d="M329.7 726.1c-7.7 0-15.4-2.9-21.3-8.8-11.7-11.7-11.6-30.7 0.1-42.4L659 326.2c11.7-11.7 30.7-11.6 42.4 0.1s11.6 30.7-0.1 42.4L350.9 717.3c-5.9 5.9-13.5 8.8-21.2 8.8z" fill="#d81e06" p-id="1876"></path><path d="M688.3 725.4c-7.7 0-15.4-2.9-21.3-8.8L318.3 366c-11.7-11.7-11.6-30.7 0.1-42.4s30.7-11.6 42.4 0.1l348.7 350.5c11.7 11.7 11.6 30.7-0.1 42.4-5.8 5.9-13.4 8.8-21.1 8.8z" fill="#d81e06" p-id="1877"></path></svg>擦边球站</span>
                            <span style={{ color: "red", marginLeft: "15px" }}><svg t="1586595445601" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1874" width="16" height="16"><path d="M514.5 989.6c-64.5 0-127.1-12.6-186.1-37.6-56.9-24.1-108-58.5-151.9-102.4-43.9-43.9-78.3-95-102.4-151.9-24.9-58.9-37.6-121.5-37.6-186.1s12.6-127.1 37.6-186.1c24.1-56.9 58.5-108 102.4-151.9s95-78.3 151.9-102.4c59-24.9 121.6-37.6 186.1-37.6s127.1 12.6 186.1 37.6c56.9 24.1 108 58.5 151.9 102.4 43.9 43.9 78.3 95 102.4 151.9 24.9 58.9 37.6 121.5 37.6 186.1s-12.6 127.1-37.6 186.1c-24.1 56.9-58.5 108-102.4 151.9-43.9 43.9-95 78.3-151.9 102.4-59 24.9-121.6 37.6-186.1 37.6z m0-896c-230.5 0-418 187.5-418 418s187.5 418 418 418 418-187.5 418-418c-0.1-230.5-187.6-418-418-418z" fill="#d81e06" p-id="1875"></path><path d="M329.7 726.1c-7.7 0-15.4-2.9-21.3-8.8-11.7-11.7-11.6-30.7 0.1-42.4L659 326.2c11.7-11.7 30.7-11.6 42.4 0.1s11.6 30.7-0.1 42.4L350.9 717.3c-5.9 5.9-13.5 8.8-21.2 8.8z" fill="#d81e06" p-id="1876"></path><path d="M688.3 725.4c-7.7 0-15.4-2.9-21.3-8.8L318.3 366c-11.7-11.7-11.6-30.7 0.1-42.4s30.7-11.6 42.4 0.1l348.7 350.5c11.7 11.7 11.6 30.7-0.1 42.4-5.8 5.9-13.4 8.8-21.1 8.8z" fill="#d81e06" p-id="1877"></path></svg>红标报毒</span>
                            <span style={{ color: "#333", marginLeft: "15px" }}><svg t="1586595574482" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2711" width="16" height="16"><path d="M512 1024C229.216 1024 0 794.784 0 512S229.216 0 512 0s512 229.216 512 512-229.216 512-512 512z m-90.496-403.84l-98.08-98.016a32 32 0 0 0-45.248 0l-15.072 15.072a32 32 0 0 0 0 45.248l120.672 120.672 15.072 15.104a32 32 0 0 0 45.28 0l316.8-316.8a32 32 0 0 0 0-45.248l-15.104-15.072a32 32 0 0 0-45.248 0l-279.072 279.04z" fill="#27CC82" p-id="2712"></path></svg>技术类</span>
                            <span style={{ color: "#333", marginLeft: "15px" }}><svg t="1586595574482" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2711" width="16" height="16"><path d="M512 1024C229.216 1024 0 794.784 0 512S229.216 0 512 0s512 229.216 512 512-229.216 512-512 512z m-90.496-403.84l-98.08-98.016a32 32 0 0 0-45.248 0l-15.072 15.072a32 32 0 0 0 0 45.248l120.672 120.672 15.072 15.104a32 32 0 0 0 45.28 0l316.8-316.8a32 32 0 0 0 0-45.248l-15.104-15.072a32 32 0 0 0-45.248 0l-279.072 279.04z" fill="#27CC82" p-id="2712"></path></svg>IT科技</span>
                            <span style={{ color: "#333", marginLeft: "15px" }}><svg t="1586595574482" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2711" width="16" height="16"><path d="M512 1024C229.216 1024 0 794.784 0 512S229.216 0 512 0s512 229.216 512 512-229.216 512-512 512z m-90.496-403.84l-98.08-98.016a32 32 0 0 0-45.248 0l-15.072 15.072a32 32 0 0 0 0 45.248l120.672 120.672 15.072 15.104a32 32 0 0 0 45.28 0l316.8-316.8a32 32 0 0 0 0-45.248l-15.104-15.072a32 32 0 0 0-45.248 0l-279.072 279.04z" fill="#27CC82" p-id="2712"></path></svg>移动互联网</span>
                            <span style={{ color: "#333", marginLeft: "15px" }}><svg t="1586595574482" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2711" width="16" height="16"><path d="M512 1024C229.216 1024 0 794.784 0 512S229.216 0 512 0s512 229.216 512 512-229.216 512-512 512z m-90.496-403.84l-98.08-98.016a32 32 0 0 0-45.248 0l-15.072 15.072a32 32 0 0 0 0 45.248l120.672 120.672 15.072 15.104a32 32 0 0 0 45.28 0l316.8-316.8a32 32 0 0 0 0-45.248l-15.104-15.072a32 32 0 0 0-45.248 0l-279.072 279.04z" fill="#27CC82" p-id="2712"></path></svg>生活分享类</span>
                        </h4>
                        <div className="rule">
                            <h4>交换友链可在留言板留言.同时请将本站加入友链</h4>
                            <h4>名称：ModestFun</h4>
                            <h4>网址：https://www.modestfun.com/</h4>
                            <h4>图标：https://www.modestfun.com:8080/img/?name=logo</h4>
                            <h4>描述：一个四非大学的预备钱端攻城狮🦁</h4>
                            <h4>特别提醒： 申请提交后若无其它原因将在24小时内完成审核,如超过时间还未通过,请留言或私信给我.</h4>
                        </div>
                    </div>
                    <div className="friendWall">
                        <h2 className="ruleTitle">0.私人项目</h2>
                        <div className="friendItem">
                            {
                                mine.map((v, k) => (
                                    <div key={k} className="itemWall">
                                        <a target="_blank" href={v.website}>
                                            <img src={v.logoUrl} alt="" />
                                            <h2>{v.name}</h2>
                                            <p>{v.describe}</p>
                                        </a>
                                    </div>
                                ))
                            }
                        </div>
                        <h2 className="ruleTitle">1.身边的朋友</h2>
                        <div className="friendItem">
                            {
                                near.map((v, k) => (
                                    <div key={k} className="itemWall">
                                        <a target="_blank" href={v.website}>
                                            <img src={v.logoUrl} alt="" />
                                            <h2>{v.name}</h2>
                                            <p>{v.describe}</p>
                                        </a>
                                    </div>
                                ))
                            }
                        </div>

                        <h2 className="ruleTitle">2.远方的伙伴</h2>
                        <div className="friendItem">
                            {
                                far.map((v, k) => (
                                    <div key={k} className="itemWall">
                                        <a target="_blank" href={v.website}>
                                            <img src={v.logoUrl} alt="" />
                                            <h2>{v.name}</h2>
                                            <p>{v.describe}</p>
                                        </a>
                                    </div>
                                ))
                            }
                        </div>

                        <h2 className="ruleTitle">3.云端的大佬</h2>
                        <div className="friendItem">
                            {
                                big.map((v, k) => (
                                    <div key={k} className="itemWall">
                                        <a target="_blank" href={v.website}>
                                            <img src={v.logoUrl} alt="" />
                                            <h2>{v.name}</h2>
                                            <p>{v.describe}</p>
                                        </a>
                                    </div>
                                ))
                            }
                        </div>

                    </div>
                </div>
            </div>
        )
    }
}
